tap "adoptopenjdk/openjdk"
tap "homebrew/cask-fonts"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"

cask_args appdir: "/Applications"

brew "ack"
brew "binutils"
brew "python"
brew "ccat"
brew "cocoapods"
brew "coreutils"
brew "diffutils"
brew "ffmpeg"
brew "findutils"
brew "fzf"
brew "gawk"
brew "git"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-time"
brew "gnu-which"
brew "gnupg"
brew "grep"
brew "gzip"
brew "jq"
brew "jupyterlab"
brew "mas"
brew "moreutils"
brew "neovim"
brew "pyenv"
brew "rbenv"
brew "rename"
brew "rsync"
brew "ruby"
brew "screen"
brew "starship"
brew "stow"
brew "tmux"
brew "tree"
brew "vim"
brew "wget"
brew "yarn"
brew "zlib"
brew "zplug"
brew "zsh"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"

cask "adoptopenjdk8"
cask "adoptopenjdk8-jre"
cask "alacritty"
cask "alfred"
cask "docker"
cask "bitbar"
cask "cheatsheet"
cask "dozer"
cask "font-hack"
cask "font-hack-nerd-font"
cask "fsnotes"
cask "google-chrome"
cask "intel-haxm"
cask "kap"
cask "lulu"
cask "slack"
cask "the-unarchiver"
cask "visual-studio-code"

# install gradle here, since by now the jdk is installed
brew "gradle"

mas "KakaoTalk", id: 869223134
mas "Gifski", id: 1351639930
